# Переменные
username = "Арамаис Саркисян" # Имя пользователя
title = "Список дел" # Заголовок заметки
conten = "Купить продукты, убраться в доме, прочитать книгу." # Описание заметки
status = "Активна" # Статус заметки
created_date = "23-12-2024" # Дата создания заметки
issue_date = "26-12-2024" # Дата истечения заметки

# Вывод значений
print("Имя пользователя:", username)
print("Заголовок заметки:", title)
print("Описание заметки:", conten)
print("Статус заметки:", status)
print("Дата создания заметки:", created_date)
print("Дата истечения заметки:", issue_date)